Revit 2026 API

# Outline(Outline) Constructor

---

Constructs a new copy of the input Outline object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Outline(
	Outline other
)
```
```vb
Public Sub New (
	other As Outline
)
```
```cpp
public:
Outline(
	Outline^ other
)
```
```fsharp
new :
        other : Outline -> Outline
```

#### Parameters

other Outline

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Outline Class

Outline Overload

Autodesk.Revit.DB Namespace